content/topics/dorian_mode.md
+++
title = "Dorian mode"
author = ["hermes"]
tags = ["music"]
draft = false
+++

## Overview {#overview}

Dorian is the second mode of the major scale — constructed by starting the major scale on its second degree. It is a minor mode (minor third, minor seventh) distinguished from the natural minor (Aeolian) by a raised sixth scale degree. This raised sixth is what gives Dorian its characteristic soulful, hopeful quality: darker than major, but less resigned than pure minor.


## Formula {#formula}

Whole – Half – Whole – Whole – Whole – Half – Whole
(W–H–W–W–W–H–W)

Compared to natural minor (Aeolian): identical except degree 6, which is raised by a semitone.


## Characteristic sound and the Dorian lift {#characteristic-sound-and-the-dorian-lift}

The raised 6th creates the signature chord move known as the **Dorian lift**: i → IV (minor tonic to major subdominant). In Bb Dorian:

-   Bbm (i) → Eb major (IV)
-   The Eb chord contains the raised 6th (G natural) — the note that "lifts" the harmony out of pure darkness.

This move is ubiquitous in soul, funk, and soulful house music, where it produces a sense of emotional opening or yearning.


## Relationship to parent major scale {#relationship-to-parent-major-scale}

Dorian is a **mode** of the major scale, not a separate scale. Bb Dorian uses exactly the same pitches as Ab major — it is the Ab major scale played starting on Bb. This means a track in Bb Dorian shares its full diatonic note pool with a track in Ab major or F minor, enabling smooth [Harmonic mixing]({{< relref "harmonic_mixing.md" >}}) across those keys.

Parent scale relationships:

-   Bb Dorian = Ab major scale starting on Bb (2nd degree).
-   D Dorian = C major scale starting on D.
-   A Dorian = G major scale starting on A.


## Use in house music {#use-in-house-music}

In a 3-track set structured as F minor → Bb Dorian → Ab major, Bb Dorian occupies the emotional middle position: more open than F minor's chromatic darkness, not yet fully resolved into Ab major's brightness. The Dorian lift (Bbm → Eb) functions as the set's emotional pivot. See [House music]({{< relref "house_music.md" >}}) for the full worked example.

See also: [Relative major and minor]({{< relref "relative_major_minor.md" >}}), [Circle of fifths]({{< relref "circle_of_fifths.md" >}}).


## Resources {#resources}

-   2026-06-07 ◦ [House Music: Melody, Bass Lines, and Harmony](~/repos/priv/roam-sources/articles/2026/2026-06-07_house-music-theory-melody-bass-harmony.md) — used Bb Dorian as the middle track in a 3-track house set; explained the Dorian lift (i → IV) as the emotional pivot between chromatic tension (F minor) and euphoric release (Ab major)
